CS3710_Docker Image_Files/portfolio_app/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "school_email", "major", "expected_graduation_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "school_email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_email", "tester@msudenver.edu"], ["updated_at", "2024-09-17 18:48:33.856452"], ["id", 1]]

  def destroy
    @student.destroy!
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]